M = 1.0;          % Маса візка
m = 0.2;          % Маса маятника
l = 1.0;          % Довжина маятника
g = 9.81;         % Гравітація
b = 0.1;          % Тертя візка
I = (1/12)*m*l^2; % Момент інерції


%% --- НАБІР 1 (Базовий і стабільний) ---
P_x = 0.1;     I_x = 0;      D_x = 0.15;      % Зовнішній (позиція) — додатні
P_theta = -25; I_theta = 0;  D_theta = -5;    % Внутрішній (кут) — ВІД'ЄМНІ

%% --- НАБІР 2 (Більш жорстке утримання кута) ---
% P_x = 0.15;    I_x = 0.01;   D_x = 0.2;
% P_theta = -35; I_theta = -0.1; D_theta = -7;

%% --- НАБІР 3 (Плавний, для повільних переміщень) ---
% P_x = 0.05;    I_x = 0;      D_x = 0.1;
% P_theta = -18; I_theta = 0;  D_theta = -3;